zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_hifi1_COMMON.h
/*
** ###################################################################
**     Processors:          MIMXRT798SGAWBR_hifi1
**                          MIMXRT798SGFOB_hifi1
**                          MIMXRT798SGVKB_hifi1
**
**     Compiler:            Xtensa Compiler
**     Reference manual:    iMXRT700RM Rev.5, 10/2025
**     Version:             rev. 6.0, 2025-12-29
**     Build:               b260429
**
**     Abstract:
**         Peripheral Access Layer for MIMXRT798S_hifi1
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**     - rev. 5.0 (2025-11-13)
**         Add puf/sdadc irq and cache64 compatibility macros to common header.
**     - rev. 5.1 (2025-12-08)
**         Update RM version and add pdm irq for hifi1/hifi4.
**     - rev. 6.0 (2025-12-29)
**         Add new part number.
**
** ###################################################################
*/

/*!
 * @file MIMXRT798S_hifi1_COMMON.h
 * @version 6.0
 * @date 2025-12-29
 * @brief Peripheral Access Layer for MIMXRT798S_hifi1
 *
 * Peripheral Access Layer for MIMXRT798S_hifi1
 */

#if !defined(MIMXRT798S_HIFI1_COMMON_H_)
#define MIMXRT798S_HIFI1_COMMON_H_               /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0600U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U

/* ----------------------------------------------------------------------------
   --
   ---------------------------------------------------------------------------- */

/* IO definitions (access restrictions to peripheral registers) */
/**
    \defgroup CMSIS_glob_defs CMSIS Global Defines
    <strong>IO Type Qualifiers</strong> are used
    \li to specify the access to peripheral variables.
    \li for automatic generation of peripheral register debug information.
*/
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

#define __STATIC_INLINE static inline

#define __BKPT(value) do {} while(0)
#define __NOP() do {} while(0)

#include "system_MIMXRT798S_hifi1.h"     /* Device specific configuration file */



/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 80                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Device specific interrupts */
  NonMaskableInt_IRQn          = 0,                /**< Interrupt selected by HIFI1_INTERRUPT0 */
  Software_IRQn                = 1,                /**< Software triggered Interrupt */
  RtosTimer0_IRQn              = 2,                /**< Internal RTOS Timer0 Interrupt */
  RtosTimer1_IRQn              = 3,                /**< Internal RTOS Timer1 Interrupt */
  Profiling_IRQn               = 4,                /**< Profiling Interrupt */
  WriteError_IRQn              = 5,                /**< Write Error */
  DSP_INT0_SEL1_IRQn           = 6,                /**< Interrupt selected by HIFI1_INTERRUPT1 */
  DSP_INT0_SEL2_IRQn           = 7,                /**< Interrupt selected by HIFI1_INTERRUPT2 */
  DSP_INT0_SEL3_IRQn           = 8,                /**< Interrupt selected by HIFI1_INTERRUPT3 */
  DSP_INT0_SEL4_IRQn           = 9,                /**< Interrupt selected by HIFI1_INTERRUPT4 */
  DSP_INT0_SEL5_IRQn           = 10,               /**< Interrupt selected by HIFI1_INTERRUPT5 */
  DSP_INT0_SEL6_IRQn           = 11,               /**< Interrupt selected by HIFI1_INTERRUPT6 */
  DSP_INT0_SEL7_IRQn           = 12,               /**< Interrupt selected by HIFI1_INTERRUPT7 */
  DSP_INT0_SEL8_IRQn           = 13,               /**< Interrupt selected by HIFI1_INTERRUPT8 */
  DSP_INT0_SEL9_IRQn           = 14,               /**< Interrupt selected by HIFI1_INTERRUPT9 */
  DSP_INT0_SEL10_IRQn          = 15,               /**< Interrupt selected by HIFI1_INTERRUPT10 */
  DSP_INT0_SEL11_IRQn          = 16,               /**< Interrupt selected by HIFI1_INTERRUPT11 */
  DSP_INT0_SEL12_IRQn          = 17,               /**< Interrupt selected by HIFI1_INTERRUPT12 */
  DSP_INT0_SEL13_IRQn          = 18,               /**< Interrupt selected by HIFI1_INTERRUPT13 */
  DSP_INT0_SEL14_IRQn          = 19,               /**< Interrupt selected by HIFI1_INTERRUPT14 */
  DSP_INT0_SEL15_IRQn          = 20,               /**< Interrupt selected by HIFI1_INTERRUPT15 */
  DSP_INT0_SEL16_IRQn          = 21,               /**< Interrupt selected by HIFI1_INTERRUPT16 */
  DSP_INT0_SEL17_IRQn          = 22,               /**< Interrupt selected by HIFI1_INTERRUPT17 */
  DSP_INT0_SEL18_IRQn          = 23,               /**< Interrupt selected by HIFI1_INTERRUPT18 */
  DSP_INT0_SEL19_IRQn          = 24,               /**< Interrupt selected by HIFI1_INTERRUPT19 */
  DSP_INT0_SEL20_IRQn          = 25,               /**< Interrupt selected by HIFI1_INTERRUPT20 */
  DSP_INT0_SEL21_IRQn          = 26,               /**< Interrupt selected by HIFI1_INTERRUPT21 */
  DSP_INT0_SEL22_IRQn          = 27,               /**< Interrupt selected by HIFI1_INTERRUPT22 */
  DSP_INT0_SEL23_IRQn          = 28,               /**< Interrupt selected by HIFI1_INTERRUPT23 */
  DSP_INT0_SEL24_IRQn          = 29,               /**< Interrupt selected by HIFI1_INTERRUPT24 */
  DSP_INT0_SEL25_IRQn          = 30,               /**< Interrupt selected by HIFI1_INTERRUPT25 */
  DSP_INT0_SEL26_IRQn          = 31,               /**< Interrupt selected by HIFI1_INTERRUPT26 */
  LP_FLEXCOMM17_IRQn           = 32,               /**< LP_FLEXCOMM17 (HIFI1_INTTERRUPTn source IRQ0) */
  LP_FLEXCOMM18_IRQn           = 33,               /**< LP_FLEXCOMM18 (HIFI1_INTTERRUPTn source IRQ1) */
  LP_FLEXCOMM19_IRQn           = 34,               /**< LP_FLEXCOMM19 (HIFI1_INTTERRUPTn source IRQ2) */
  LP_FLEXCOMM20_IRQn           = 35,               /**< LP_FLEXCOMM20 (HIFI1_INTTERRUPTn source IRQ3) */
  PMC1_IRQn                    = 36,               /**< PMC1 (HIFI1_INTTERRUPTn source IRQ4) */
  GPIO8_CH0_IRQn               = 37,               /**< GPIO8_CH0 (HIFI1_INTTERRUPTn source IRQ5) */
  GPIO8_CH1_IRQn               = 38,               /**< GPIO8_CH1 (HIFI1_INTTERRUPTn source IRQ6) */
  GPIO9_CH0_IRQn               = 39,               /**< GPIO9_CH0 (HIFI1_INTTERRUPTn source IRQ7) */
  GPIO9_CH1_IRQn               = 40,               /**< GPIO9_CH1 (HIFI1_INTTERRUPTn source IRQ8) */
  GPIO10_CH0_IRQn              = 41,               /**< GPIO10_CH0 (HIFI1_INTTERRUPTn source IRQ9) */
  GPIO10_CH1_IRQn              = 42,               /**< GPIO10_CH1 (HIFI1_INTTERRUPTn source IRQ10) */
  WWDT2_IRQn                   = 43,               /**< WWDT2 (HIFI1_INTTERRUPTn source IRQ11) */
  WWDT3_IRQn                   = 44,               /**< WWDT3 (HIFI1_INTTERRUPTn source IRQ12) */
  MU0_MUB_IRQn                 = 45,               /**< MU0_MUB (HIFI1_INTTERRUPTn source IRQ13) */
  MU3_MUB_IRQn                 = 46,               /**< MU3_MUB (HIFI1_INTTERRUPTn source IRQ14) */
  UTICK1_IRQn                  = 47,               /**< UTICK1 (HIFI1_INTTERRUPTn source IRQ15) */
  MRT1_IRQn                    = 48,               /**< MRT1 (HIFI1_INTTERRUPTn source IRQ16) */
  OSTIMER_IRQn                 = 49,               /**< OSTIMER (HIFI1_INTTERRUPTn source IRQ17) */
  CTIMER5_IRQn                 = 50,               /**< CTIMER5 (HIFI1_INTTERRUPTn source IRQ18) */
  CTIMER6_IRQn                 = 51,               /**< CTIMER6 (HIFI1_INTTERRUPTn source IRQ19) */
  CTIMER7_IRQn                 = 52,               /**< CTIMER7 (HIFI1_INTTERRUPTn source IRQ20) */
  RTC1_IRQn                    = 53,               /**< RTC1 (HIFI1_INTTERRUPTn source IRQ21) */
  RTC_SS1_IRQn                 = 54,               /**< RTC_SS1 (HIFI1_INTTERRUPTn source IRQ22) */
  I3C2_IRQn                    = 55,               /**< I3C2 (HIFI1_INTTERRUPTn source IRQ23) */
  I3C3_IRQn                    = 56,               /**< I3C3 (HIFI1_INTTERRUPTn source IRQ24) */
  PDM_EVENT_IRQn               = 57,               /**< MICFIL (HIFI1_INTTERRUPTn source IRQ25) */
  PDM_HWVAD_EVENT_IRQn         = 58,               /**< MICFIL HWVAD (HIFI1_INTTERRUPTn source IRQ26) */
  EDMA2_CH0_IRQn               = 59,               /**< EDMA2_CH0 (HIFI1_INTTERRUPTn source IRQ27) */
  EDMA2_CH1_IRQn               = 60,               /**< EDMA2_CH1 (HIFI1_INTTERRUPTn source IRQ28) */
  EDMA2_CH2_IRQn               = 61,               /**< EDMA2_CH2 (HIFI1_INTTERRUPTn source IRQ29) */
  EDMA2_CH3_IRQn               = 62,               /**< EDMA2_CH3 (HIFI1_INTTERRUPTn source IRQ30) */
  EDMA2_CH4_IRQn               = 63,               /**< EDMA2_CH4 (HIFI1_INTTERRUPTn source IRQ31) */
  EDMA2_CH5_IRQn               = 64,               /**< EDMA2_CH5 (HIFI1_INTTERRUPTn source IRQ32) */
  EDMA2_CH6_IRQn               = 65,               /**< EDMA2_CH6 (HIFI1_INTTERRUPTn source IRQ33) */
  EDMA2_CH7_IRQn               = 66,               /**< EDMA2_CH7 (HIFI1_INTTERRUPTn source IRQ34) */
  EDMA3_CH0_IRQn               = 67,               /**< EDMA3_CH0 (HIFI1_INTTERRUPTn source IRQ35) */
  EDMA3_CH1_IRQn               = 68,               /**< EDMA3_CH1 (HIFI1_INTTERRUPTn source IRQ36) */
  EDMA3_CH2_IRQn               = 69,               /**< EDMA3_CH2 (HIFI1_INTTERRUPTn source IRQ37) */
  EDMA3_CH3_IRQn               = 70,               /**< EDMA3_CH3 (HIFI1_INTTERRUPTn source IRQ38) */
  EDMA3_CH4_IRQn               = 71,               /**< EDMA3_CH4 (HIFI1_INTTERRUPTn source IRQ39) */
  EDMA3_CH5_IRQn               = 72,               /**< EDMA3_CH5 (HIFI1_INTTERRUPTn source IRQ40) */
  EDMA3_CH6_IRQn               = 73,               /**< EDMA3_CH6 (HIFI1_INTTERRUPTn source IRQ41) */
  EDMA3_CH7_IRQn               = 74,               /**< EDMA3_CH7 (HIFI1_INTTERRUPTn source IRQ42) */
  PIN_INT0_IRQn                = 75,               /**< Pin interrupt0 (HIFI1_INTTERRUPTn source IRQ43) */
  PIN_INT1_IRQn                = 76,               /**< Pin interrupt1 (HIFI1_INTTERRUPTn source IRQ44) */
  PIN_INT2_IRQn                = 77,               /**< Pin interrupt2 (HIFI1_INTTERRUPTn source IRQ45) */
  PIN_INT3_IRQn                = 78,               /**< Pin interrupt3 (HIFI1_INTTERRUPTn source IRQ46) */
  SAI3_TX_RX_IRQn              = 79                /**< SAI3_TX_RX (HIFI1_INTTERRUPTn source IRQ47) */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


#ifndef MIMXRT798S_hifi1_SERIES
#define MIMXRT798S_hifi1_SERIES
#endif
/* CPU specific feature definitions */
#include "MIMXRT798S_hifi1_features.h"

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

